In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\dory\anaconda3\lib\site-packages (1.2.4)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\dory\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.16.5 in c:\users\dory\anaconda3\lib\site-packages (from pandas) (1.20.1)
Requirement already satisfied: pytz>=2017.3 in c:\users\dory\anaconda3\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: six>=1.5 in c:\users\dory\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [2]:
import pandas as pd

In [3]:
pd

# pandas.Series

In [4]:
hipandas=pd.Series([1,2,3,4,5])
print(hipandas)         #顯示Series
print(hipandas.values)  #顯示值
print(hipandas.index)   #顯示索引

0    1
1    2
2    3
3    4
4    5
dtype: int64
[1 2 3 4 5]
RangeIndex(start=0, stop=5, step=1)

In [6]:
hipandas1=pd.Series([3,4,5,6,7])
print(hipandas1)         #顯示Series
print(hipandas1.values)  #顯示值
print(hipandas1.index)   #顯示索引

0    3
1    4
2    5
3    6
4    7
dtype: int64
[3 4 5 6 7]
RangeIndex(start=0, stop=5, step=1)

In [13]:
dict1={"Taipei":"台北","Taichung":"台中","Kaohsing":"高雄"}

In [14]:
city=pd.Series(dict1)

In [15]:
print(city)

Taipei      台北
Taichung    台中
Kaohsing    高雄
dtype: object

In [16]:
print(city.values)

['台北' '台中' '高雄']

In [17]:
print(city.index)

Index(['Taipei', 'Taichung', 'Kaohsing'], dtype='object')

In [18]:
print(city["Taipei"])

台北

In [19]:
print(city["Taichung":"Kaohsing"])

Taichung    台中
Kaohsing    高雄
dtype: object

In [20]:
hipandas[0]

1

In [21]:
hipandas[1]

2

In [22]:
hipandas[2]

3

In [23]:
sel=pd.Series([1,2,3,4,5],index=["a","b","c","d","e"])

In [24]:
sel["a"]

1

In [25]:
sel["b"]

2

In [26]:
sel["c"]

3

# DataFrame

In [29]:
df=pd.DataFrame([[65,92,78,83,70],
                [57,76,78,97,100],
                [87,89,45,90,65],
                [78,98,90,99,96]],
                index=["王曉明","李小美","陳大同","林小玉"],
                columns=["國文","英文","數學","自然","社會"])
df

     國文  英文  數學  自然   社會
王曉明  65  92  78  83   70
李小美  57  76  78  97  100
陳大同  87  89  45  90   65
林小玉  78  98  90  99   96

In [31]:
#dictionary file
scores={'國文':{'王曉明':65,'李小美':57,'陳大同':87,'林小玉':78},
        '英文':{'王曉明':92,'李小美':76,'陳大同':89,'林小玉':98},
        '數學':{'王曉明':78,'李小美':78,'陳大同':45,'林小玉':90},
        '自然':{'王曉明':83,'李小美':97,'陳大同':90,'林小玉':99},
        '社會':{'王曉明':70,'李小美':100,'陳大同':65,'林小玉':96}}


df2 = pd.DataFrame(scores)
df2

     國文  英文  數學  自然   社會
王曉明  65  92  78  83   70
李小美  57  76  78  97  100
陳大同  87  89  45  90   65
林小玉  78  98  90  99   96

In [34]:
#Use Series
se1=pd.Series({'王曉明':65,'李小美':57,'陳大同':87,'林小玉':78})
se2=pd.Series({'王曉明':92,'李小美':76,'陳大同':89,'林小玉':98})
se3=pd.Series({'王曉明':78,'李小美':78,'陳大同':45,'林小玉':90})        
se4=pd.Series({'王曉明':83,'李小美':97,'陳大同':90,'林小玉':99})     
se5=pd.Series({'王曉明':70,'李小美':100,'陳大同':65,'林小玉':96})     

df3=pd.concat([se1,se2,se3,se4,se5],axis=1)
df3.columns=["國文","英文","數學","自然","社會"]
df3

     國文  英文  數學  自然   社會
王曉明  65  92  78  83   70
李小美  57  76  78  97  100
陳大同  87  89  45  90   65
林小玉  78  98  90  99   96

In [35]:
se1 = pd.Series({'王小明':65,'李小美':90,'陳大同':81,'林小玉':79})
se2 = pd.Series({'王小明':92,'李小美':72,'陳大同':85,'林小玉':53})
se3 = pd.Series({'王小明':78,'李小美':76,'陳大同':91,'林小玉':47})
se4 = pd.Series({'王小明':83,'李小美':93,'陳大同':89,'林小玉':94})
se5 = pd.Series({'王小明':70,'李小美':56,'陳大同':94,'林小玉':80})
df4 = pd.concat([se1,se2,se3,se4,se5], axis=1)
df4.columns=['國文','英文','數學','自然','社會']
df4

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [36]:
df4["自然"]

王小明    83
李小美    93
陳大同    89
林小玉    94
Name: 自然, dtype: int64

In [37]:
df4["數學"]

王小明    78
李小美    76
陳大同    91
林小玉    47
Name: 數學, dtype: int64

In [38]:
df4["社會"]

王小明    70
李小美    56
陳大同    94
林小玉    80
Name: 社會, dtype: int64

In [40]:
df4[['自然','數學','社會']]

     自然  數學  社會
王小明  83  78  70
李小美  93  76  56
陳大同  89  91  94
林小玉  94  47  80

In [41]:
df4[df4["國文"]>=80]

     國文  英文  數學  自然  社會
李小美  90  72  76  93  56
陳大同  81  85  91  89  94

In [42]:
df4[df4["數學"]>=80]

     國文  英文  數學  自然  社會
陳大同  81  85  91  89  94

In [43]:
df4[df4["英文"]>=90]

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70

In [52]:
df4[df4["社會"]<=70]

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56

In [54]:
df4[df4["英文"]<=60]

     國文  英文  數學  自然  社會
林小玉  79  53  47  94  80

In [55]:
df4[df4["國文"]<=80]

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
林小玉  79  53  47  94  80

In [44]:
df4.values

array([[65, 92, 78, 83, 70],
       [90, 72, 76, 93, 56],
       [81, 85, 91, 89, 94],
       [79, 53, 47, 94, 80]], dtype=int64)

In [45]:
df4.values[1]

array([90, 72, 76, 93, 56], dtype=int64)

In [46]:
df4.values[1][2]

76

In [47]:
df4.values[3][4]

80

In [48]:
df4.loc["林小玉","社會"]

80

In [49]:
df4.loc["王小明",["國文","社會"]]

國文    65
社會    70
Name: 王小明, dtype: int64

In [51]:
df4.loc[["王小明","李小美"],["數學","自然"]]

     數學  自然
王小明  78  83
李小美  76  93

In [56]:
df4.loc["陳大同",:]

國文    81
英文    85
數學    91
自然    89
社會    94
Name: 陳大同, dtype: int64

In [58]:
df4.loc[:"李小美","數學":"社會"]

     數學  自然  社會
王小明  78  83  70
李小美  76  93  56

In [61]:
df4.loc["王小明":,"國文":"社會"]

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [60]:
df4.loc["林小玉","社會"]

80

In [63]:
df4.loc["李小美","國文":"數學"]

國文    90
英文    72
數學    76
Name: 李小美, dtype: int64

In [64]:
df4.loc[:"李小美","國文":"數學"]

     國文  英文  數學
王小明  65  92  78
李小美  90  72  76